<template>
    <div>
        <button @click="toggleCollapse" class="bg-lightBlue text-black p-4 rounded-[12px] w-full flex justify-between">
            <h1 class="title">{{ titleCollapse }}</h1>
            <svg :class="{ 'transform rotate-180': isRotated }" xmlns="http://www.w3.org/2000/svg" width="30" height="30"
                viewBox="0 0 30 30" fill="none">
                <path
                    d="M2.5 15C2.5 8.09644 8.09644 2.5 15 2.5C21.9036 2.5 27.5 8.09644 27.5 15C27.5 21.9036 21.9036 27.5 15 27.5C8.09644 27.5 2.5 21.9036 2.5 15Z"
                    fill="white" />
                <path
                    d="M19.4129 16.2121C19.779 16.5782 19.779 17.1718 19.4129 17.5379C19.0468 17.904 18.4532 17.904 18.0871 17.5379L15 14.4508L11.9129 17.5379C11.5468 17.904 10.9532 17.904 10.5871 17.5379C10.221 17.1718 10.221 16.5782 10.5871 16.2121L14.3371 12.4621C14.7032 12.096 15.2968 12.096 15.6629 12.4621L19.4129 16.2121Z"
                    fill="#00B9FF" />
            </svg>
        </button>

        <div v-if="!collapsed" class="p-3 bg-white rounded-b-[12px]">
            <div v-for="item in items" :key="item.number" class="mb-4 p-4 rounded-full"
                style="background: rgba(0, 187, 255, 0.206);">
                <div class="flex px-4 items-center justify-between mb-2">
                    <div class="flex items-center gap-2">
                        <div class="bg-blueTheme text-white py-1 px-3 rounded-full">{{ item.number }}</div>
                        <div class="text-lg">{{ item.title }}</div>
                    </div>
                    <div class="flex items-center gap-8">
                        <Rating :maxStars="5" :initialRating="item.rating" />
                        <span class="mr-4">
                            <svg xmlns="http://www.w3.org/2000/svg" width="31" height="30" viewBox="0 0 31 30" fill="none">
                                <path fill-rule="evenodd" clip-rule="evenodd"
                                    d="M18.1914 27.5H13.1914C8.47736 27.5 6.12034 27.5 4.65587 26.0355C3.19141 24.5711 3.19141 22.214 3.19141 17.5V12.5C3.19141 7.78595 3.19141 5.42893 4.65587 3.96447C6.12034 2.5 8.48977 2.5 13.2286 2.5C13.9862 2.5 14.5932 2.5 15.1039 2.52083C15.0871 2.62074 15.0783 2.72266 15.0779 2.82571L15.0664 6.36871C15.0663 7.74009 15.0662 8.95205 15.1975 9.92895C15.3399 10.9878 15.6668 12.0466 16.5309 12.9107C17.395 13.7748 18.4537 14.1016 19.5126 14.244C20.4895 14.3753 21.7015 14.3752 23.0728 14.3751L23.1914 14.3751H28.1382C28.1914 15.043 28.1914 15.8626 28.1914 16.9536V17.5C28.1914 22.214 28.1914 24.5711 26.7269 26.0355C25.2625 27.5 22.9055 27.5 18.1914 27.5Z"
                                    fill="#00B9FF" />
                                <path
                                    d="M10.6914 18.125C10.6914 19.1605 10.1318 20 9.44141 20C8.75105 20 8.19141 19.1605 8.19141 18.125C8.19141 17.0895 8.75105 16.25 9.44141 16.25C10.1318 16.25 10.6914 17.0895 10.6914 18.125Z"
                                    fill="white" />
                                <path
                                    d="M12.4615 21.0951C12.0307 20.8078 11.4487 20.9243 11.1615 21.3551C10.8743 21.7859 10.9907 22.3679 11.4215 22.6551C14.0072 24.379 17.3758 24.379 19.9615 22.6551C20.3923 22.3679 20.5088 21.7859 20.2216 21.3551C19.9343 20.9243 19.3523 20.8078 18.9215 21.0951C16.9656 22.399 14.4174 22.399 12.4615 21.0951Z"
                                    fill="white" />
                                <path
                                    d="M23.1914 18.125C23.1914 19.1605 22.6318 20 21.9414 20C21.251 20 20.6914 19.1605 20.6914 18.125C20.6914 17.0895 21.251 16.25 21.9414 16.25C22.6318 16.25 23.1914 17.0895 23.1914 18.125Z"
                                    fill="white" />
                                <path
                                    d="M15.078 2.82512L15.0664 6.36812C15.0663 7.7395 15.0662 8.95147 15.1975 9.92836C15.3399 10.9873 15.6668 12.046 16.5309 12.9101C17.395 13.7742 18.4537 14.1011 19.5126 14.2434C20.4895 14.3748 21.7014 14.3747 23.0728 14.3746L28.1382 14.3745C28.1537 14.569 28.1647 14.7763 28.1725 14.9994H28.1914C28.1914 14.6651 28.1914 14.4979 28.179 14.301C28.1083 13.1828 27.6435 11.9016 26.9808 10.9982C26.8641 10.8391 26.7843 10.7437 26.6248 10.5527C25.6341 9.36699 24.3302 7.88991 23.1914 6.87441C22.1778 5.97056 20.7897 4.9817 19.5791 4.17312C18.539 3.47843 18.0189 3.13109 17.3058 2.87293C17.1168 2.80448 16.8674 2.72888 16.6722 2.68082C16.1922 2.56267 15.7249 2.52157 15.0664 2.50732L15.078 2.82512Z"
                                    fill="#0043AE" />
                            </svg>
                        </span>
                        <span class="mr-4">
                            <svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 30 30" fill="none">
                                <path fill-rule="evenodd" clip-rule="evenodd"
                                    d="M15 27.5C21.9036 27.5 27.5 21.9036 27.5 15C27.5 8.09644 21.9036 2.5 15 2.5C8.09644 2.5 2.5 8.09644 2.5 15C2.5 21.9036 8.09644 27.5 15 27.5Z"
                                    fill="#00B9FF" />
                                <path
                                    d="M19.2671 16.3237L13.3669 19.8073C12.4171 20.368 11.25 19.6382 11.25 18.4836V11.5164C11.25 10.3618 12.4171 9.63201 13.3669 10.1927L19.2671 13.6763C20.2443 14.2532 20.2443 15.7468 19.2671 16.3237Z"
                                    fill="white" />
                            </svg>
                        </span>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>
  
<script>
import Rating from '@/components/Rating/Rating.vue'; // Укажите путь к вашему компоненту рейтинга

export default {
    props: {
        items: {
            type: Array,
            default: () => [],
        },
        titleCollapse: {
            type: String,
        },
    },
    components: {
        Rating,
    },
    data() {
        return {
            collapsed: true,
            isRotated: false,
            items: [
                // Добавьте другие элементы по необходимости
            ],
        };
    },
    methods: {
        toggleCollapse() {
            this.collapsed = !this.collapsed;
            this.isRotated = !this.isRotated;

        },
    },
};
</script>
  
<style scoped>
/* Добавьте стили по необходимости */
</style>
  